[
  {
    "title": "NDIS vs NDIA",
    "slug": "ndis-vs-ndia",
    "date": "2025-04-18",
    "description": "Understand the key differences between the National Disability Insurance Scheme (NDIS) and the National Disability Insurance Agency (NDIA), their roles, and how they work together to support Australians with disabilities.",
    "image": "https://cdn.prod.website-files.com/67ba898f18b9815458c46343/6801c4048c32ec3d75779e12_care-assure-Zx4ddAfk0Ck-unsplash.webp",
    "readTime": "11 min read"
  },
  {
    "title": "Australia's Best Activities for Seniors: Your Ultimate Guide to Fun in Sydney & Melbourne (2025)",
    "slug": "activities-for-seniors-sydney-melbourne",
    "date": "2025-04-16",
    "description": "Discover the most enjoyable and accessible activities for seniors in Sydney and Melbourne, from cultural events and day trips to wellness classes and social clubs designed specifically for older adults.",
    "image": "https://cdn.prod.website-files.com/67ba898f18b9815458c46343/67fef87bdc87f90111443481_brandon-hoogenboom-GjvxL-2AgnU-unsplash.jpg",
    "readTime": "26 min read"
  },
  {
    "title": "Where can I use my Companion Card (NSW)",
    "slug": "where-can-i-use-my-companion-card-nsw",
    "date": "2025-04-15",
    "description": "A comprehensive guide to all the venues and attractions across NSW that accept the Companion Card, helping people with disabilities enjoy recreational activities with the support of a companion at no extra cost.",
    "image": "https://cdn.prod.website-files.com/67ba898f18b9815458c46343/67fede722e42bd5a878ec998_cdc-F98Mv9O6LfI-unsplash.jpg",
    "readTime": "20 min read"
  },
  {
    "title": "Guide to Government-Funded Personal Alarms in Australia",
    "slug": "government-funded-personal-alarms",
    "date": "2025-03-11",
    "description": "Learn about the various government programs that provide funding for personal alarms and emergency response systems, eligibility requirements, and how to apply for these essential safety devices.",
    "image": "",
    "readTime": "15 min read"
  },
  {
    "title": "Home Care Package Changes: The New Support at Home Program",
    "slug": "home-care-package-changes-the-new-support-at-home-program",
    "date": "2025-03-09",
    "description": "Explore the recent transition from Home Care Packages to the new Support at Home Program, including key changes, benefits, and what current and future recipients need to know about this important reform.",
    "image": "",
    "readTime": "7 min read"
  },
  {
    "title": "Home Care Package Level 2 Guide",
    "slug": "home-care-package-level-2",
    "date": "2025-03-09",
    "description": "Everything you need to know about Level 2 Home Care Packages, including available services, funding amounts, eligibility criteria, and how to make the most of your package to support independent living.",
    "image": "",
    "readTime": "9 min read"
  },
  {
    "title": "The Comprehensive Guide to Level 3 Home Care Package in 2025",
    "slug": "level-3-home-care-package",
    "date": "2025-03-09",
    "description": "A detailed overview of Level 3 Home Care Packages, covering the increased level of care and support available, typical services included, funding allocations, and how to navigate the assessment process.",
    "image": "",
    "readTime": "7 min read"
  },
  {
    "title": "Top 20 NDIS Providers in Sydney",
    "slug": "top-ndis-providers-in-sydney",
    "date": "2025-03-09",
    "description": "Compare the best NDIS providers across Sydney, featuring detailed reviews, service specialties, coverage areas, and tips for choosing the right provider to meet your specific disability support needs.",
    "image": "",
    "readTime": "13 min read"
  },
  {
    "title": "A Guide to Improved Liveability Homes in SDA",
    "slug": "improved-liveability-sda",
    "date": "2025-03-06",
    "description": "Understand the Improved Liveability design category in Specialist Disability Accommodation (SDA), including design features, benefits for participants, funding eligibility, and how to find suitable properties.",
    "image": "",
    "readTime": "6 min read"
  },
  {
    "title": "Guide to Becoming an Independent NDIS Support Worker",
    "slug": "guide-to-becoming-an-independent-support-worker",
    "date": "2025-03-06",
    "description": "Step-by-step instructions for becoming an independent NDIS support worker, covering registration requirements, qualifications, insurance, pricing your services, and building a sustainable client base.",
    "image": "",
    "readTime": "7 min read"
  },
  {
    "title": "How Much Does Respite Care Cost Per Day? (NDIS)",
    "slug": "how-much-does-respite-care-cost-per-day-ndis",
    "date": "2025-03-06",
    "description": "A breakdown of current NDIS respite care costs, including daily rates for different levels of support, funding caps, provider variations, and strategies for maximizing your NDIS budget for respite services.",
    "image": "",
    "readTime": "6 min read"
  },
  {
    "title": "NDIS Community Participation Guide",
    "slug": "ndis-community-participation",
    "date": "2025-03-06",
    "description": "Explore how NDIS funding can support community participation goals, including available services, finding inclusive activities, developing social skills, and building meaningful connections within your community.",
    "image": "",
    "readTime": "8 min read"
  },
  {
    "title": "NDIS Price Guide 2024-2025",
    "slug": "ndis-price-guide",
    "date": "2025-03-06",
    "description": "The latest comprehensive breakdown of NDIS pricing for 2024-2025, including updated rates for all support categories, pricing changes from previous years, and how to navigate the price guide for budget planning.",
    "image": "",
    "readTime": "6 min read"
  },
  {
    "title": "NDIS Respite and Short-Term Accommodation Pricing Guide 2024-25",
    "slug": "ndis-respite-sta-pricing-guide-2024-25",
    "date": "2025-03-06",
    "description": "Detailed pricing information for NDIS respite and Short-Term Accommodation services in 2024-25, including support ratios, complex care rates, and guidance on maximizing these essential supports in your plan.",
    "image": "",
    "readTime": "7 min read"
  },
  {
    "title": "NDIS Support Worker Pay Rates",
    "slug": "ndis-support-worker-pay-rates",
    "date": "2025-03-06",
    "description": "Current pay scales for NDIS support workers across different skill levels and support types, including base rates, casual loadings, penalty rates, and how funding levels determine worker remuneration.",
    "image": "",
    "readTime": "6 min read"
  },
  {
    "title": "How to Apply for the NDIS: Your Complete Step-by-Step Guide",
    "slug": "apply-for-funding",
    "date": "2025-02-24",
    "description": "A comprehensive walkthrough of the NDIS application process, from checking eligibility and gathering evidence to submitting your Access Request Form and preparing for the planning meeting.",
    "image": "",
    "readTime": "7 min read"
  },
  {
    "title": "Join Our Team of Support Workers in Sydney",
    "slug": "support-workers-in-sydney",
    "date": "2025-02-23",
    "description": "Learn about exciting career opportunities for support workers in our growing Sydney team, including job benefits, flexible scheduling options, training opportunities, and how to apply.",
    "image": "https://cdn.prod.website-files.com/67ba898f18b9815458c46343/67baad9bd87ba750e0be84ae_Screenshot%202025-02-23%20at%204.08.45%E2%80%AFpm.webp",
    "readTime": "2 min read"
  },
  {
    "title": "Level 4 Home Care Package Complete Guide",
    "slug": "level-4-home-care-package",
    "date": "2025-02-23",
    "description": "Everything you need to know about the highest level of Home Care Package support, including the extensive services covered, funding amounts, eligibility requirements, and managing your Level 4 package effectively.",
    "image": "https://cdn.prod.website-files.com/67ba898f18b9815458c46343/67baa2c6b21db79b34b31c4f_dominik-lange-VUOiQW4OeLI-unsplash.webp",
    "readTime": "6 min read"
  },
  {
    "title": "Understanding STA Meaning in NDIS: A Comprehensive Guide",
    "slug": "understanding-sta-meaning-in-ndis",
    "date": "2025-02-23",
    "description": "Demystifying Short Term Accommodation (STA) under the NDIS, including what it covers, who's eligible, how to include it in your plan, and finding quality STA providers that meet your specific needs.",
    "image": "https://cdn.prod.website-files.com/67ba898f18b9815458c46343/67bab1b323b017da45fe302f_dr-kanapon-phumratprapin-xOvJBvcame8-unsplash.webp",
    "readTime": "4 min read"
  }
]