{
  "title": "Personal Care Services",
  "slug": "personal-care",
  "description": "Comprehensive personal care services tailored to your individual needs. Our trained support workers assist with daily activities, hygiene, medication management, and more to enhance your quality of life and independence.",
  "content": "<h2>Professional Personal Care Support</h2><p>Our personal care services provide compassionate support with everyday tasks that help maintain dignity, independence, and wellbeing. Our trained support workers assist with daily activities that might be challenging due to disability, aging, or recovery from illness.</p><h3>Our Personal Care Services Include:</h3><ul><li><strong>Personal Hygiene:</strong> Assistance with bathing, showering, toileting, and grooming</li><li><strong>Dressing:</strong> Help with dressing and undressing, including assistance with specialized clothing needs</li><li><strong>Medication Management:</strong> Reminders and assistance with taking prescribed medications</li><li><strong>Mobility Support:</strong> Help with transfers, positioning, and movement around the home</li><li><strong>Meal Assistance:</strong> Help with eating and drinking</li><li><strong>Continence Care:</strong> Dignified assistance with continence management</li><li><strong>Morning and Evening Routines:</strong> Assistance with waking up and preparing for the day or getting ready for bed</li></ul><h3>Person-Centered Approach</h3><p>We understand that personal care is just that - personal. Our support is tailored to your unique preferences, cultural background, and individual needs. We work collaboratively with you to develop a personal care plan that respects your choices and promotes your independence.</p><h3>Qualified Support Workers</h3><p>All our personal care support workers are:</p><ul><li>Professionally trained and qualified</li><li>Experienced in providing compassionate personal care</li><li>Background-checked and screened</li><li>Committed to upholding privacy and dignity</li><li>Regularly supervised and supported</li></ul><h3>NDIS Funded Personal Care</h3><p>Our personal care services can be accessed through NDIS funding under Core Supports - Assistance with Daily Life. We can help you understand how to use your NDIS plan to access the personal care support you need.</p><h3>Getting Started with Personal Care Support</h3><p>We begin with a thorough assessment of your needs and preferences, then match you with compatible support workers who can provide consistent, reliable care. Our service coordinators regularly check in to ensure your needs are being met and adjust your support as required.</p><h2><a href=\"/contact\">Contact Us About Personal Care Services</a></h2><p>Our team is ready to discuss how our personal care services can support you or your loved one. Contact us today to learn more about our approach and how we can help.</p>",
  "image": "",
  "category": "Daily Living Support",
  "date": "2024-07-23"
} 