[
  {
    "title": "NDIS vs NDIA",
    "slug": "ndis-vs-ndia",
    "date": "2025-04-18",
    "description": "Here's a quick comparison table:",
    "image": "https://cdn.prod.website-files.com/67ba898f18b9815458c46343/6801c4048c32ec3d75779e12_care-assure-Zx4ddAfk0Ck-unsplash.webp",
    "readTime": "11 min read"
  },
  {
    "title": "Australia's Best Activities for Seniors: Your Ultimate Guide to Fun in Sydney & Melbourne (2025)",
    "slug": "activities-for-seniors-sydney-melbourne",
    "date": "2025-04-16",
    "description": "Retirement isn't an ending; it's the beginning of a vibrant new chapter filled with possibilities. Staying active, engaged, and connected is key to making these years truly golden, boosting not just p...",
    "image": "https://cdn.prod.website-files.com/67ba898f18b9815458c46343/67fef87bdc87f90111443481_brandon-hoogenboom-GjvxL-2AgnU-unsplash.jpg",
    "readTime": "26 min read"
  },
  {
    "title": "Where can I use my Companion Card (NSW)",
    "slug": "where-can-i-use-my-companion-card-nsw",
    "date": "2025-04-15",
    "description": "Participating fully in community life, enjoying events, and accessing services are fundamental aspects of well-being. However, for individuals living with significant and permanent disabilities who re...",
    "image": "https://cdn.prod.website-files.com/67ba898f18b9815458c46343/67fede722e42bd5a878ec998_cdc-F98Mv9O6LfI-unsplash.jpg",
    "readTime": "20 min read"
  },
  {
    "title": "Guide to Government-Funded Personal Alarms in Australia",
    "slug": "government-funded-personal-alarms",
    "date": "2025-03-11",
    "description": "Personal alarms, also known as medical alerts or emergency response systems, are vital for elderly and disabled individuals to live independently while ensuring they can call for help in emergencies. ...",
    "image": "",
    "readTime": "14 min read"
  },
  {
    "title": "Home Care Package Changes: The New Support at Home Program",
    "slug": "home-care-package-changes-the-new-support-at-home-program",
    "date": "2025-03-09",
    "description": "The Support at Home program is a major reform in Australia's aged care system, designed to enhance in-home care for older people. Set to launch on July 1, 2025, it will replace the Home Care Packages ...",
    "image": "",
    "readTime": "7 min read"
  },
  {
    "title": "Home Care Package Level 2 Guide",
    "slug": "home-care-package-level-2",
    "date": "2025-03-09",
    "description": "Home care package level 2 is designed for older Australians with low-level care needs, helping them stay independent at home. It covers daily tasks like cleaning, personal care, and transport, funded ...",
    "image": "",
    "readTime": "9 min read"
  },
  {
    "title": "The Comprehensive Guide to Level 3 Home Care Package in 2025",
    "slug": "level-3-home-care-package",
    "date": "2025-03-09",
    "description": "A level 3 home care package is part of Australia's government-subsidized program to help older adults and those with complex needs live independently at home. It's designed for intermediate care needs...",
    "image": "",
    "readTime": "7 min read"
  },
  {
    "title": "Top 20 NDIS Providers in Sydney",
    "slug": "top-ndis-providers-in-sydney",
    "date": "2025-03-09",
    "description": "The National Disability Insurance Scheme (NDIS) is a vital program in Australia that supports people with disabilities, and finding the right provider in Sydney can make a significant difference. This...",
    "image": "",
    "readTime": "12 min read"
  },
  {
    "title": "A Guide to Improved Liveability Homes in SDA",
    "slug": "improved-liveability-sda",
    "date": "2025-03-06",
    "description": "Improved liveability SDA is a type of specialist disability accommodation designed to improve living conditions for individuals with sensory, intellectual, or cognitive impairments. It provides a reas...",
    "image": "",
    "readTime": "6 min read"
  },
  {
    "title": "Guide to Becoming an Independent NDIS Support Worker",
    "slug": "guide-to-becoming-an-independent-support-worker",
    "date": "2025-03-06",
    "description": "Becoming an independent support worker for the National Disability Insurance Scheme (NDIS) in Australia can be a rewarding career, offering flexibility and the chance to make a direct impact. This gui...",
    "image": "",
    "readTime": "7 min read"
  },
  {
    "title": "How Much Does Respite Care Cost Per Day? (NDIS)",
    "slug": "how-much-does-respite-care-cost-per-day-ndis",
    "date": "2025-03-06",
    "description": "Respite care, or Short Term Accommodation (STA) under NDIS, covers support for up to 28 days per year, often in 14-day blocks. The cost per day depends on:",
    "image": "",
    "readTime": "6 min read"
  },
  {
    "title": "NDIS Community Participation Guide",
    "slug": "ndis-community-participation",
    "date": "2025-03-06",
    "description": "NDIS community participation is a vital part of the National Disability Insurance Scheme, helping individuals with disabilities engage in social and community activities. This guide will walk you thro...",
    "image": "",
    "readTime": "8 min read"
  },
  {
    "title": "NDIS Price Guide 2024-2025",
    "slug": "ndis-price-guide",
    "date": "2025-03-06",
    "description": "The National Disability Insurance Scheme (NDIS) Price Guide is a vital document that details pricing arrangements and limits for various supports and services under the NDIS. It ensures clarity and tr...",
    "image": "",
    "readTime": "6 min read"
  },
  {
    "title": "NDIS Respite and Short-Term Accommodation Pricing Guide 2024-25",
    "slug": "ndis-respite-sta-pricing-guide-2024-25",
    "date": "2025-03-06",
    "description": "The National Disability Insurance Scheme (NDIS) offers short-term accommodation (STA) and respite care to support people with disabilities and their caregivers. STA provides temporary housing and care...",
    "image": "",
    "readTime": "7 min read"
  },
  {
    "title": "NDIS Support Worker Pay Rates",
    "slug": "ndis-support-worker-pay-rates",
    "date": "2025-03-06",
    "description": "NDIS support worker pay rates are the hourly wages set for workers assisting people with disabilities under the National Disability Insurance Scheme (NDIS). These rates depend on various factors, incl...",
    "image": "",
    "readTime": "6 min read"
  },
  {
    "title": "How to Apply for the NDIS: Your Complete Step-by-Step Guide",
    "slug": "apply-for-funding",
    "date": "2025-02-24",
    "description": "The National Disability Insurance Scheme (NDIS) is a transformative Australian government initiative designed to provide support and funding to individuals with permanent and significant disabilities,...",
    "image": "",
    "readTime": "7 min read"
  },
  {
    "title": "Join Our Team of Support Workers in Sydney",
    "slug": "support-workers-in-sydney",
    "date": "2025-02-23",
    "description": "Are you looking for a rewarding career where you can make a real difference in people's lives? As a support worker in Sydney, you'll have the opportunity to transform lives while building a fulfilling...",
    "image": "https://cdn.prod.website-files.com/67ba898f18b9815458c46343/67baad9bd87ba750e0be84ae_Screenshot%202025-02-23%20at%204.08.45%E2%80%AFpm.webp",
    "readTime": "2 min read"
  },
  {
    "title": "Level 4 Home Care Package Complete Guide",
    "slug": "level-4-home-care-package",
    "date": "2025-02-23",
    "description": "Level 4 Home Care Packages (HCP) are for Australians with high care needs, offering up to $62,013 annually.",
    "image": "https://cdn.prod.website-files.com/67ba898f18b9815458c46343/67baa2c6b21db79b34b31c4f_dominik-lange-VUOiQW4OeLI-unsplash.webp",
    "readTime": "6 min read"
  },
  {
    "title": "Understanding STA Meaning in NDIS: A Comprehensive Guide",
    "slug": "understanding-sta-meaning-in-ndis",
    "date": "2025-02-23",
    "description": "The NDIS funds STA to achieve two key goals:",
    "image": "https://cdn.prod.website-files.com/67ba898f18b9815458c46343/67bab1b323b017da45fe302f_dr-kanapon-phumratprapin-xOvJBvcame8-unsplash.webp",
    "readTime": "3 min read"
  }
]